xavi-oc/qemu/hw/timer/esp32s3_systimer.c
/*
 * ESP32S3 System Timer
 *
 * Copyright (c) 2023 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qapi/error.h"
#include "qapi/visitor.h"
#include "hw/hw.h"
#include "hw/sysbus.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "hw/registerfields.h"
#include "hw/boards.h"
#include "hw/timer/esp32s3_systimer.h"


#define TICKS_TO_NS(ticks) (((ticks) / ESP32S3_SYSTIMER_CNT_PER_US) * 1000)

#define SYSTIMER_DEBUG      0
#define SYSTIMER_WARNING    0

/**
 * @brief Update the value of a counter according the QEMU virtual timer.
 */
static void esp32s3_systimer_update_counter(ESP32S3SysTimerCounter *counter) {
    const int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    const int64_t elapsed_ns = now - counter->base;
    const int64_t ticks = (elapsed_ns * (ESP32S3_SYSTIMER_CNT_CLK / 1000000)) / 1000;
    counter->value = (counter->value + ticks) & ESP32S3_SYSTIMER_52BIT_MASK;
    counter->base = now;
}


static void esp32s3_systimer_set_irqs(ESP32S3SysTimerState *s)
{
    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        ESP32S3SysTimerComp* comparator = &s->comparators[i];
        /* Optimize a bit by not calling the interrupt module if the state didn't change */
        const int new_level = comparator->raw_st && comparator->int_enabled;
#if SYSTIMER_DEBUG
        info_report("[SYSTIMER] esp32s3_systimer_set_irqs(%d) comparator number=%d, count = %d, new_level=%d, raw_st=%d, int_enabled=%d", 
            i, comparator->number, comparator->counter, new_level, comparator->raw_st, comparator->int_enabled);
#endif
        if (new_level != comparator->cur_irq_level) {
            comparator->cur_irq_level = new_level;
            qemu_set_irq(comparator->irq, new_level);
        }
    }
}


static void esp32s3_systimer_notify(ESP32S3SysTimerComp* comparator)
{
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] esp32s3_systimer_notify comparator number=%d", comparator->number); 
    static int64_t previous = 0;
    info_report("Elapsed since last interrupt %ld ns", now - previous);
    previous = now;
#endif

    /* Update the counter linked to the comparator */
    const uint32_t counter_idx = comparator->counter;
    ESP32S3SysTimerState *s = comparator->systimer;
    ESP32S3SysTimerCounter* counter = &s->counter[counter_idx];

    if (counter->enabled) {
        esp32s3_systimer_update_counter(counter);
    }

    /* Set the IRQ line if anything changed */
    comparator->cur_irq_level = 1;
    qemu_irq_raise(comparator->irq);

    /* Check if we have to reload the comparator's timer */
    if (counter->enabled && comparator->period_mode) {
        // info_report("[SYSTIMER] esp32s3_systimer_notify");
        /**
         * If the timer is periodic, we have to compensate the delay that may have been taken
         * by QEMU framework. Indeed, this timer may have been triggered too late (tenth of us)
         * As such, compensate here by triggering the next timer earlier.
         */
        const int64_t diff_ns = now - comparator->expire_time;
        const int64_t target_ns = now + TICKS_TO_NS(comparator->period);
        int64_t adjusted_target_ns = target_ns;

        if (diff_ns < target_ns) {
            adjusted_target_ns = target_ns - diff_ns;
        }

        comparator->expire_time = adjusted_target_ns;
        timer_mod_ns(&comparator->qtimer, adjusted_target_ns);
    }
}


/**
 * @brief Function called when the configuration of the given comparator changed.
 * It will reprogram the QEMU Timer according to the new parameters. The comparator
 * must be enabled when this function is called.
 */
static void esp32s3_systimer_comparator_reprogram(ESP32S3SysTimerComp* comparator)
{
    if (!comparator->enabled)
    {
        return;
    }
    assert(comparator->enabled);

#if SYSTIMER_DEBUG
    warn_report("[SYSTIMER] esp32s3_systimer_comparator_reprogram = %d, counter = %d", comparator->number, comparator->counter);
#endif //  SYSTIMER_DEBUG

    const uint32_t counter_idx = comparator->counter;
    ESP32S3SysTimerState *s = comparator->systimer;
    ESP32S3SysTimerCounter* counter = &s->counter[counter_idx];

    /* Update the counter to get the latest value */
    esp32s3_systimer_update_counter(counter);

    /* If the counter we have to compare it to is not enabled, do not program any timer */
    if (!counter->enabled) {
        /* "Disable" the timer */
        timer_del(&comparator->qtimer);
#if SYSTIMER_DEBUG
        info_report("comparator->qtimer timer_del %d",comparator->number);
#endif //  SYSTIMER_DEBUG
        return;
    }

    /**
     * According to the TRM, if the comparator (alarm) is smaller than the counter value and the
     * difference is bigger or equal to (2^51) - 1, the alarm is not triggered right now and the counter
     * will have to overflow first before reached the comparator value.
     */
    const int64_t count_val = counter->value;
    const int64_t alarm = comparator->value;
    const bool overflow_valid = alarm < count_val && count_val - alarm >= ((1ULL << 51) - 1);

    if (!comparator->period_mode && !overflow_valid && alarm <= count_val) {
        timer_del(&comparator->qtimer);
#if SYSTIMER_DEBUG
        info_report("comparator->qtimer timer_del %d",comparator->number);
#endif// SYSTIMER_DEBUG
        esp32s3_systimer_notify(comparator);
        return;
    }

    /* Calculate in how many ns the counter would reach the comparator */
    uint64_t diff = 0;

    if (comparator->period_mode) {
        diff = comparator->period;
    } else if (overflow_valid) {
        diff = ((ESP32S3_SYSTIMER_52BIT_MASK + 1) - count_val) + alarm;
    } else {
        diff = alarm - count_val;
    }

    /* Calculate the number of ns the counter will take to reach the absolute count */
    const int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    const int64_t target_ns = now + TICKS_TO_NS(diff);
    comparator->expire_time = target_ns;
    timer_mod_ns(&comparator->qtimer, target_ns);
#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] qtimer timer_mod_ns (%d) = %08lx", comparator->number, target_ns);
#endif // SYSTIMER_DEBUG

