xavi-oc/qemu/hw/timer/esp32s3_systimer.c
}


static uint32_t esp32s3_systimer_comparator_get_conf(ESP32S3SysTimerComp *comp)
{
    uint32_t reg = comp->period & R_SYSTIMER_TARGET0_CONF_PERIOD_MASK;
    reg |= (comp->period_mode << R_SYSTIMER_TARGET0_CONF_PERIOD_MODE_SHIFT) & R_SYSTIMER_TARGET0_CONF_PERIOD_MODE_MASK;
    reg |= (comp->counter << R_SYSTIMER_TARGET0_CONF_TIMER_UNIT_SEL_SHIFT) & R_SYSTIMER_TARGET0_CONF_TIMER_UNIT_SEL_MASK;
    return reg;
}


static uint64_t esp32s3_systimer_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESP32S3SysTimerState *s = ESP32S3_SYSTIMER(opaque);
    uint64_t r = 0;

    switch (addr) {
        case A_SYSTIMER_CONF:
            r = s->conf;
            break;
        case A_SYSTIMER_UNIT0_OP:
        case A_SYSTIMER_UNIT1_OP:
            /* Value is always synchronized and valid */
            r = R_SYSTIMER_UNIT0_OP_VALUE_VALID_MASK;
            break;

        /* Registers linked to UNIT0 registers */
        case A_SYSTIMER_UNIT0_VALUE_HI:
            r = SYSTIMER_GET_REG(s->counter[0].flushed, 32, R_SYSTIMER_UNIT0_VALUE_HI_TIMER_HI_MASK);
            break;
        case A_SYSTIMER_UNIT0_VALUE_LO:
            r = SYSTIMER_GET_REG(s->counter[0].flushed, 0, R_SYSTIMER_UNIT0_VALUE_LO_TIMER_LO_MASK);
            break;
        case A_SYSTIMER_UNIT0_LOAD_HI:
            r = SYSTIMER_GET_REG(s->counter[0].toload, 32, R_SYSTIMER_UNIT0_LOAD_HI_HI_MASK);
            break;
        case A_SYSTIMER_UNIT0_LOAD_LO:
            r = SYSTIMER_GET_REG(s->counter[0].toload, 0, R_SYSTIMER_UNIT0_LOAD_LO_LO_MASK);
            break;

        /* Same for UNIT1 */
        case A_SYSTIMER_UNIT1_VALUE_HI:
            r = SYSTIMER_GET_REG(s->counter[1].flushed, 32, R_SYSTIMER_UNIT1_VALUE_HI_TIMER_HI_MASK);
            break;
        case A_SYSTIMER_UNIT1_VALUE_LO:
            r = SYSTIMER_GET_REG(s->counter[1].flushed, 0, R_SYSTIMER_UNIT1_VALUE_LO_TIMER_LO_MASK);
            break;
        case A_SYSTIMER_UNIT1_LOAD_HI:
            r = SYSTIMER_GET_REG(s->counter[1].toload, 32, R_SYSTIMER_UNIT1_LOAD_HI_HI_MASK);
            break;
        case A_SYSTIMER_UNIT1_LOAD_LO:
            r = SYSTIMER_GET_REG(s->counter[1].toload, 0, R_SYSTIMER_UNIT1_LOAD_LO_LO_MASK);
            break;

        /* Read back the value of the comparators */
        case A_SYSTIMER_TARGET0_HI:
            r = SYSTIMER_GET_REG(s->comparators[0].value_toload, 32, R_SYSTIMER_TARGET0_HI_HI_MASK);
            break;
        case A_SYSTIMER_TARGET0_LO:
            r = SYSTIMER_GET_REG(s->comparators[0].value_toload, 0, R_SYSTIMER_TARGET0_LO_LO_MASK);
            break;
        case A_SYSTIMER_TARGET0_CONF:
            r = esp32s3_systimer_comparator_get_conf(&s->comparators[0]);
            break;

        /* Registers linked to Comparator 1 */
        case A_SYSTIMER_TARGET1_HI:
            r = SYSTIMER_GET_REG(s->comparators[1].value_toload, 32, R_SYSTIMER_TARGET1_HI_HI_MASK);
            break;
        case A_SYSTIMER_TARGET1_LO:
            r = SYSTIMER_GET_REG(s->comparators[1].value_toload, 0, R_SYSTIMER_TARGET1_LO_LO_MASK);
            break;
        case A_SYSTIMER_TARGET1_CONF:
            r = esp32s3_systimer_comparator_get_conf(&s->comparators[1]);
            break;

        /* Registers linked to Comparator 2 */
        case A_SYSTIMER_TARGET2_HI:
            r = SYSTIMER_GET_REG(s->comparators[2].value_toload, 32, R_SYSTIMER_TARGET2_HI_HI_MASK);
            break;
        case A_SYSTIMER_TARGET2_LO:
            r = SYSTIMER_GET_REG(s->comparators[2].value_toload, 0, R_SYSTIMER_TARGET2_LO_LO_MASK);
            break;
        case A_SYSTIMER_TARGET2_CONF:
            r = esp32s3_systimer_comparator_get_conf(&s->comparators[2]);
            break;

        /* Interrupt related */
        case A_SYSTIMER_INT_RAW:
            r = s->comparators[0].raw_st << R_SYSTIMER_INT_RAW_TARGET0_SHIFT
              | s->comparators[1].raw_st << R_SYSTIMER_INT_RAW_TARGET1_SHIFT
              | s->comparators[2].raw_st << R_SYSTIMER_INT_RAW_TARGET2_SHIFT;
            break;

        case A_SYSTIMER_INT_ENA:
            r = s->comparators[0].int_enabled << R_SYSTIMER_INT_ENA_TARGET0_SHIFT
              | s->comparators[1].int_enabled << R_SYSTIMER_INT_ENA_TARGET1_SHIFT
              | s->comparators[2].int_enabled << R_SYSTIMER_INT_ENA_TARGET2_SHIFT;
            break;

        case A_SYSTIMER_INT_ST:
            r = (s->comparators[0].raw_st & s->comparators[0].int_enabled) << R_SYSTIMER_INT_ST_TARGET0_SHIFT
              | (s->comparators[1].raw_st & s->comparators[1].int_enabled) << R_SYSTIMER_INT_ST_TARGET1_SHIFT
              | (s->comparators[2].raw_st & s->comparators[2].int_enabled) << R_SYSTIMER_INT_ST_TARGET2_SHIFT;
            break;

        case A_SYSTIMER_INT_CLR:
            /* This register is read-only */
            break;

        default:
#if SYSTIMER_WARNING
            warn_report("[SYSTIMER] Unsupported read to %08lx", addr);
#endif
            break;
    }

#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] Reading from %08lx (%08lx)", addr, r);
#endif
    return r;
}

/**
 * @brief Function called when a guest program requests a flush of the internal
 * counter inside a mirror register: `flushed`.
 */
static void esp32s3_systimer_flush_counter(ESP32S3SysTimerCounter *counter)
{
    /* If the counter is enabled, get its latest value */
    if (counter->enabled) {
        esp32s3_systimer_update_counter(counter);
    }
    /* In any case, flush the value to send to the guest program */
    counter->flushed = counter->value;
}

/**
 * @brief Function called when the guest programs wants to replace the value
 * of the given counter
 */
static void esp32s3_systimer_load_counter(ESP32S3SysTimerState *s, uint32_t index)
{

#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] esp32s3_systimer_load_counter %d ", index);
#endif// SYSTIMER_DEBUG
   
    ESP32S3SysTimerCounter* counter = &s->counter[index];

    /* If the counter is enabled, update the internal value to the latest count.
     * Even though the value will be replaced, this will also update the base time. */
    if (counter->enabled) {
        esp32s3_systimer_update_counter(counter);
    }
    counter->value = counter->toload;

