xavi-oc/qemu/hw/timer/esp32s3_systimer.c
    /* If one of the comparator is enabled and depends on the current timer, reprogram it */
    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
#if SYSTIMER_DEBUG
        info_report("[SYSTIMER] esp32s3_systimer_load_counter comparator = %d, int_enabled = %d, enabled = %d, counter=%d ", 
            i, (int)s->comparators[i].int_enabled, (int)s->comparators[i].enabled, s->comparators[i].counter);
#endif// SYSTIMER_DEBUG
        if (s->comparators[i].enabled && s->comparators[i].counter == index) {
            esp32s3_systimer_comparator_reprogram(&s->comparators[i]);
        }
    }
}


static void esp32s3_systimer_comparator_conf(ESP32S3SysTimerComp* comparator, uint64_t value)
{
    uint32_t old_counter = comparator->counter;
    comparator->period_mode = (value & R_SYSTIMER_TARGET0_CONF_PERIOD_MODE_MASK) ? 1 : 0;
    comparator->counter = (value & R_SYSTIMER_TARGET0_CONF_TIMER_UNIT_SEL_MASK) ? 1 : 0;
    comparator->period_toload = value & R_SYSTIMER_TARGET0_CONF_PERIOD_MASK;

#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] esp32s3_systimer_comparator_conf(%d) %lx , comparator->counter=%d", comparator->number, value, comparator->counter);
#endif// SYSTIMER_DEBUG
    /* If the comparator is enabled while the counter to compare it to changed, reload the timer! */
    if (comparator->enabled && old_counter != comparator->counter) {
        esp32s3_systimer_comparator_reprogram(comparator);
    }
}


static void esp32s3_systimer_comparator_reload(ESP32S3SysTimerComp* comparator)
{
#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] esp32s3_systimer_comparator_reload(%d)", comparator->number);
#endif// SYSTIMER_DEBUG
    comparator->period = comparator->period_toload;
    comparator->value = comparator->value_toload;

    if (comparator->enabled) {
        /* The period changed, reprogram the QEMU timer */
        esp32s3_systimer_comparator_reprogram(comparator);
    }
}


static void esp32s3_systimer_conf_set(ESP32S3SysTimerState *s, uint64_t value)
{
    bool state[ESP32S3_SYSTIMER_COMP_COUNT] = { 0 };
    bool state_counter[ESP32S3_SYSTIMER_COUNTER_COUNT] = { 0 };

    for (int i = 0; i < ESP32S3_SYSTIMER_COUNTER_COUNT; i++) {
        state_counter[i] = s->counter[i].enabled;
    }
    s->counter[0].enabled = (value & R_SYSTIMER_CONF_TIMER_UNIT0_WORK_EN_MASK) ? 1 : 0;
    s->counter[1].enabled = (value & R_SYSTIMER_CONF_TIMER_UNIT1_WORK_EN_MASK) ? 1 : 0;
    s->counter[0].enabled_on_stall = (value & R_SYSTIMER_CONF_TIMER_UNIT0_CORE0_STALL_EN_MASK) ? 1 : 0;
    s->counter[1].enabled_on_stall = (value & R_SYSTIMER_CONF_TIMER_UNIT1_CORE0_STALL_EN_MASK) ? 1 : 0;

    /* If the state of the counter changed while one of the comparator depends on it, reload it */
    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        const int count_idx = s->comparators[i].counter;

        if (s->comparators[i].enabled && state_counter[count_idx] != s->counter[count_idx].enabled) {
            esp32s3_systimer_comparator_reprogram(&s->comparators[i]);
        }
    }


    /**
     * Do the same thing for the comparators: assign the new state while checking if a change occurred,
     * if that's the case, reprogram it.
     */
    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        state[i] = s->comparators[i].enabled;
    }

    s->comparators[0].enabled = (value & R_SYSTIMER_CONF_TARGET0_WORK_EN_MASK) ? 1 : 0;
    s->comparators[1].enabled = (value & R_SYSTIMER_CONF_TARGET1_WORK_EN_MASK) ? 1 : 0;
    s->comparators[2].enabled = (value & R_SYSTIMER_CONF_TARGET2_WORK_EN_MASK) ? 1 : 0;

    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        if (state[i] == s->comparators[i].enabled) {
            continue;
        }

        /* If the comparator has just been enabled, (re)program it.
         * If it was enabled and it is now disabled, disable the QEMU timer. */
        if (s->comparators[i].enabled) {
            esp32s3_systimer_comparator_reprogram(&s->comparators[i]);
        } else {
            timer_del(&s->comparators[i].qtimer);
#if SYSTIMER_DEBUG
            info_report("comparator->qtimer timer_del %d",s->comparators[i].number);
#endif // SYSTIMER_DEBUG
        }
    }

    /* Ignore R_SYSTIMER_CONF_CLK_EN */
    s->conf = (uint32_t) value;
}


static void esp32s3_systimer_write(void *opaque, hwaddr addr,
                                   uint64_t value, unsigned int size)
{
    ESP32S3SysTimerState *s = ESP32S3_SYSTIMER(opaque);
    (void) s;

    switch(addr) {
        case A_SYSTIMER_CONF:
            esp32s3_systimer_conf_set(s, value);
            break;
        case A_SYSTIMER_UNIT0_OP:
        case A_SYSTIMER_UNIT1_OP:
            /* Check if an update was requested on one of the timers */
            if (value & R_SYSTIMER_UNIT0_OP_UPDATE_MASK) {
                /* Address is either 4 (unit0) or 8 (unit 1), get index by dividing by 8 */
                esp32s3_systimer_flush_counter(&s->counter[addr / 8]);
            }
            break;

        /* Registers linked to UNIT0 registers */
        case A_SYSTIMER_UNIT0_LOAD_HI:
            systimer_set_reg(&s->counter[0].toload, value, R_SYSTIMER_UNIT0_LOAD_HI_HI_MASK, 32);
            break;
        case A_SYSTIMER_UNIT0_LOAD_LO:
            systimer_set_reg(&s->counter[0].toload, value, R_SYSTIMER_UNIT0_LOAD_LO_LO_MASK, 0);
            break;
        case A_SYSTIMER_UNIT0_LOAD:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_UNIT0_LOAD %08lx = %08lx", addr, value);
#endif// SYSTIMER_DEBUG
            esp32s3_systimer_load_counter(s, 0);
            break;

        /* Registers linked to UNIT1 registers */
        case A_SYSTIMER_UNIT1_LOAD_HI:
            systimer_set_reg(&s->counter[1].toload, value, R_SYSTIMER_UNIT1_LOAD_HI_HI_MASK, 32);
            break;
        case A_SYSTIMER_UNIT1_LOAD_LO:
            systimer_set_reg(&s->counter[1].toload, value, R_SYSTIMER_UNIT1_LOAD_LO_LO_MASK, 0);
            break;
        case A_SYSTIMER_UNIT1_LOAD:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_UNIT1_LOAD %08lx = %08lx", addr, value);
#endif // SYSTIMER_DEBUG
            esp32s3_systimer_load_counter(s, 1);
            break;

        /* Registers linked to Comparator 0 */
        case A_SYSTIMER_TARGET0_HI:
            systimer_set_reg(&s->comparators[0].value_toload, value, R_SYSTIMER_TARGET0_HI_HI_MASK, 32);
            break;
        case A_SYSTIMER_TARGET0_LO:
            systimer_set_reg(&s->comparators[0].value_toload, value, R_SYSTIMER_TARGET0_LO_LO_MASK, 0);
            break;
        case A_SYSTIMER_TARGET0_CONF:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_TARGET0_CONF %08lx = %08lx", addr, value);
#endif // SYSTIMER_DEBUG
            esp32s3_systimer_comparator_conf(&s->comparators[0], value);
            break;
        case A_SYSTIMER_COMP0_LOAD:
            if (value & R_SYSTIMER_COMP0_LOAD_LOAD_MASK) {
                esp32s3_systimer_comparator_reload(&s->comparators[0]);
            }
            break;

        /* Registers linked to Comparator 1 */
        case A_SYSTIMER_TARGET1_HI:
            systimer_set_reg(&s->comparators[1].value_toload, value, R_SYSTIMER_TARGET1_HI_HI_MASK, 32);
            break;
        case A_SYSTIMER_TARGET1_LO:
            systimer_set_reg(&s->comparators[1].value_toload, value, R_SYSTIMER_TARGET1_LO_LO_MASK, 0);
            break;
        case A_SYSTIMER_TARGET1_CONF:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_TARGET1_CONF %08lx = %08lx", addr, value);
#endif// SYSTIMER_DEBUG
            esp32s3_systimer_comparator_conf(&s->comparators[1], value);
            break;
        case A_SYSTIMER_COMP1_LOAD:
            if (value & R_SYSTIMER_COMP1_LOAD_LOAD_MASK) {
                esp32s3_systimer_comparator_reload(&s->comparators[1]);
            }
            break;

