xavi-oc/qemu/hw/timer/esp32s3_systimer.c
        /* Registers linked to Comparator 2 */
        case A_SYSTIMER_TARGET2_HI:
            systimer_set_reg(&s->comparators[2].value_toload, value, R_SYSTIMER_TARGET2_HI_HI_MASK, 32);
            break;
        case A_SYSTIMER_TARGET2_LO:
            systimer_set_reg(&s->comparators[2].value_toload, value, R_SYSTIMER_TARGET2_LO_LO_MASK, 0);
            break;
        case A_SYSTIMER_TARGET2_CONF:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_TARGET2_CONF %08lx = %08lx", addr, value);
#endif// SYSTIMER_DEBUG
            esp32s3_systimer_comparator_conf(&s->comparators[2], value);
            break;
        case A_SYSTIMER_COMP2_LOAD:
            if (value & R_SYSTIMER_COMP2_LOAD_LOAD_MASK) {
                esp32s3_systimer_comparator_reload(&s->comparators[2]);
            }
            break;

        /* Interrupt related */
        case A_SYSTIMER_INT_RAW:
        case A_SYSTIMER_INT_ST:
#if SYSTIMER_WARNING
            warn_report("[SYSTIMER] Unsupported write to INT RAW/ST registers");
#endif
            break;

        case A_SYSTIMER_INT_ENA:
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] Writing to %08lx = %08lx", addr, value);
#endif //SYSTIMER_DEBUG
            s->comparators[0].int_enabled = FIELD_EX32(value, SYSTIMER_INT_ENA, TARGET0);
            s->comparators[1].int_enabled = FIELD_EX32(value, SYSTIMER_INT_ENA, TARGET1);
            s->comparators[2].int_enabled = FIELD_EX32(value, SYSTIMER_INT_ENA, TARGET2);
#if SYSTIMER_DEBUG
            info_report("[SYSTIMER] A_SYSTIMER_INT_ENA(0) %x", s->comparators[0].int_enabled);
            info_report("[SYSTIMER] A_SYSTIMER_INT_ENA(1) %x", s->comparators[1].int_enabled);
            info_report("[SYSTIMER] A_SYSTIMER_INT_ENA(2) %x", s->comparators[2].int_enabled);
#endif // SYSTIMER_DEBUG
            esp32s3_systimer_comparator_reprogram(&s->comparators[0]);
            esp32s3_systimer_comparator_reprogram(&s->comparators[1]);
            esp32s3_systimer_comparator_reprogram(&s->comparators[2]);
            esp32s3_systimer_set_irqs(s);
            break;

        case A_SYSTIMER_INT_CLR:
            /* The formula (RAW & !CLR) results in 0 if both CLR and RAW were 1, else it keeps
             * RAW unchanged. */
            s->comparators[0].raw_st &= ! FIELD_EX32(value, SYSTIMER_INT_CLR, TARGET0);
            s->comparators[1].raw_st &= ! FIELD_EX32(value, SYSTIMER_INT_CLR, TARGET1);
            s->comparators[2].raw_st &= ! FIELD_EX32(value, SYSTIMER_INT_CLR, TARGET2);
            esp32s3_systimer_set_irqs(s);
            break;

        default:
#if SYSTIMER_WARNING
            warn_report("[SYSTIMER] Unsupported write to registers %08lx (%08lx)", addr, value);
#endif
            break;
    }

#if SYSTIMER_DEBUG
    info_report("[SYSTIMER] Writing to %08lx = %08lx", addr, value);
#endif
}


static const MemoryRegionOps esp32s3_systimer_ops = {
    .read =  esp32s3_systimer_read,
    .write = esp32s3_systimer_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};

static void esp32s3_systimer_cb(void* opaque)
{   
    ESP32S3SysTimerComp* comparator = (ESP32S3SysTimerComp*) opaque;
#if SYSTIMER_DEBUG
        info_report("[SYSTIMER] esp32s3_systimer_cb = %d", comparator->number);
#endif //SYSTIMER_DEBUG
    esp32s3_systimer_notify(comparator);
}


static void esp32s3_systimer_reset(DeviceState* ts)
{
    ESP32S3SysTimerState *s = ESP32S3_SYSTIMER(ts);
    s->conf = 0;
    for (int i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        ESP32S3SysTimerComp* comp = &s->comparators[i];
        QEMUTimer qtimer = comp->qtimer;
        qemu_irq irq = comp->irq;

        /* Disable all the timers/irq first */
        timer_del(&comp->qtimer);
        qemu_irq_lower(comp->irq);

        /* Reset the data of the comparator */
        memset(comp, 0, sizeof(ESP32S3SysTimerComp));

        /* Restore the former fields that were already initialized */
        comp->qtimer = qtimer;
        comp->irq = irq;
        comp->systimer = s;
    }
}


static void esp32s3_systimer_realize(DeviceState *dev, Error **errp)
{
}


static void esp32s3_systimer_init(Object *obj)
{
    ESP32S3SysTimerState *s = ESP32S3_SYSTIMER(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32s3_systimer_ops, s,
                          TYPE_ESP32S3_SYSTIMER, ESP32S3_SYSTIMER_IO_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    for (uint64_t i = 0; i < ESP32S3_SYSTIMER_COMP_COUNT; i++) {
        s->comparators[i].systimer = s;
        sysbus_init_irq(sbd, &s->comparators[i].irq);
        s->comparators[i].number = i;
        timer_init_ns(&s->comparators[i].qtimer, QEMU_CLOCK_VIRTUAL, esp32s3_systimer_cb, &s->comparators[i]);
#if SYSTIMER_DEBUG
        info_report("[SYSTIMER] esp32s3_systimer_init = %ld", i);
        info_report("comparator->qtimer timer_del %d", s->comparators[i].number);
#endif 
    }
}


static void esp32s3_systimer_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = esp32s3_systimer_reset;
    dc->realize = esp32s3_systimer_realize;
}


static const TypeInfo esp32s3_systimer_info = {
    .name = TYPE_ESP32S3_SYSTIMER,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(ESP32S3SysTimerState),
    .instance_init = esp32s3_systimer_init,
    .class_init = esp32s3_systimer_class_init
};


static void esp32s3_systimer_register_types(void)
{
    type_register_static(&esp32s3_systimer_info);
}


type_init(esp32s3_systimer_register_types)
